БМД<br>
Шарган Павло<br>
БС-83<br>

In [1]:
import pandas as pd
import random
import numpy as np

In [2]:
#Create an example table with at least 6 columns:

In [3]:
df = pd.DataFrame(columns=['PatientId', 'Height', 'Weight', 'Vo2Max', 'MaraphonPr', 'WeeklyMilage'])

In [4]:
df['PatientId'] = np.arange(10)

In [5]:
df['Height'] = np.random.normal(165,15,10)

In [6]:
df['Weight'] = np.random.normal(65,9,10)

In [7]:
df['Vo2Max'] = [random.randrange(20,96,1) for i in range(10)]

In [8]:
df['MaraphonPr'] = np.random.normal(4,0.7,10)

In [9]:
df['WeeklyMilage'] = np.random.normal(35,10,10)

In [10]:
df

   PatientId      Height     Weight  Vo2Max  MaraphonPr  WeeklyMilage
0          0  153.044474  64.744172      45    4.111085     44.535622
1          1  166.440229  79.205932      94    3.807861     18.280647
2          2  159.717178  68.997271      79    3.393504     35.422675
3          3  171.737733  56.371622      21    3.338860     35.753004
4          4  188.266098  69.499706      72    3.786383     34.153830
5          5  155.475101  60.360207      76    3.531343     43.833972
6          6  150.668735  57.932302      60    4.996408     46.327101
7          7  153.868269  59.965095      45    4.194404     22.384843
8          8  163.345895  75.073488      56    4.829520     47.421806
9          9  163.022325  63.130054      80    4.550889     54.209823

In [11]:
#Load and analyse any kaggle dataset:

In [29]:
dataset = pd.read_csv('./marathon-time-predictions/MarathonData.csv')

In [30]:
dataset

,id,Marathon,Name,Category,km4week,sp4week,CrossTraining,Wall21,MarathonTime,CATEGORY
0,1,Prague17,Blair MORGAN,MAM,132.8,14.434783,NaN,1.16,2.37,A
1,2,Prague17,Robert Heczko,MAM,68.6,13.674419,NaN,1.23,2.59,A
2,3,Prague17,Michon Jerome,MAM,82.7,13.520436,NaN,1.30,2.66,A
3,4,Prague17,Daniel Or lek,M45,137.5,12.258544,NaN,1.32,2.68,A
4,5,Prague17,Luk ? Mr zek,MAM,84.6,13.945055,NaN,1.36,2.74,A
...,...,...,...,...,...,...,...,...,...,...
82,83,Prague17,Stefano Vegliani,M55,50.0,10.830325,NaN,2.02,3.93,D
83,84,Prague17,Andrej Madliak,M40,33.6,10.130653,ciclista 3h,1.94,3.93,D
84,85,Prague17,Yoi Ohsako,M40,55.4,11.043189,NaN,1.94,3.94,D
85,86,Prague17,Simon Dunn,M45,33.2,11.066667,NaN,2.05,3.95,D
86,87,Prague17,Pavel ?imek,M40,17.9,10.848485,ciclista 5h,2.05,3.98,D

<h1>Dataset Content</h1>
<h2>id:</h2>
simple counter

<h2>Marathon:</h2>
the Marathon name where the data were extracted. I use the data coming out from Strava "Side by side comparison" and the data coming from the final marathon result

<h2>Name:</h2>
The athlete's name, still some problems with UTF-8, I'll fix that soon

<h2>Category:</h2>
the sex and age group of a runner

    MAM Male Athletes under 40 years
    WAM Women under 40 Years
    M40 Male Athletes between 40 and 45 years

<h2>km4week</h2>
This is the total number of kilometers run in the last 4 weeks before the marathon, marathon included. If, for example, the km4week is 100, the athlete has run 400 km in the four weeks before the marathon

<h2>sp4week</h2>
This is the average speed of the athlete in the last 4 training weeks. The average counts all the kilometers done, included the slow kilometers done before and after the training. A typic running session can be of 2km of slow running, then 12-14km of fast running, and finally other 2km of slow running. The average of the speed is this number, and with time this is one of the numbers that has to be refined

<h2>cross training:</h2>
If the runner is also a cyclist, or a triathlete, does it counts? Use this parameter to see if the athlete is also a cross trainer in other disciplines

<h2>Wall21:</h2>
In decimal. The tricky field. To acknowledge a good performance, as a marathoner, I have to run the first half marathon with the same split of the second half. If, for example, I run the first half marathon in 1h30m, I must finish the marathon in 3h (for doing a good job). If I finish in 3h20m, I started too fast and I hit "the wall". My training history is, therefore, less valid, since I was not estimating my result

<h2>Marathon time:</h2>
In decimal. This is the final result. Based on my training history, I must predict my expected Marathon time

<h2>Category:</h2>
This is an ancillary field. It gives some direction, so feel free to use or discard it. It groups in:

    A results under 3h
    B results between 3h and 3h20m
    C results between 3h20m and 3h40m
    D results between 3h40 and 4h

In [13]:
dataset = dataset.fillna(0)

In [14]:
dataset.shape

(87, 10)

In [15]:
type(dataset)

pandas.core.frame.DataFrame

In [16]:
dataset.dtypes

id                 int64
Marathon          object
Name              object
Category          object
km4week          float64
sp4week          float64
CrossTraining     object
Wall21            object
MarathonTime     float64
CATEGORY          object
dtype: object

In [17]:
dataset.head(5)

,id,Marathon,Name,Category,km4week,sp4week,CrossTraining,Wall21,MarathonTime,CATEGORY
0,1,Prague17,Blair MORGAN,MAM,132.8,14.434783,0,1.16,2.37,A
1,2,Prague17,Robert Heczko,MAM,68.6,13.674419,0,1.23,2.59,A
2,3,Prague17,Michon Jerome,MAM,82.7,13.520436,0,1.30,2.66,A
3,4,Prague17,Daniel Or lek,M45,137.5,12.258544,0,1.32,2.68,A
4,5,Prague17,Luk ? Mr zek,MAM,84.6,13.945055,0,1.36,2.74,A

In [18]:
dataset.tail(5)

,id,Marathon,Name,Category,km4week,sp4week,CrossTraining,Wall21,MarathonTime,CATEGORY
82,83,Prague17,Stefano Vegliani,M55,50.0,10.830325,0,2.02,3.93,D
83,84,Prague17,Andrej Madliak,M40,33.6,10.130653,ciclista 3h,1.94,3.93,D
84,85,Prague17,Yoi Ohsako,M40,55.4,11.043189,0,1.94,3.94,D
85,86,Prague17,Simon Dunn,M45,33.2,11.066667,0,2.05,3.95,D
86,87,Prague17,Pavel ?imek,M40,17.9,10.848485,ciclista 5h,2.05,3.98,D

In [19]:
dataset.describe(include = ['object'])

        Marathon          Name Category  CrossTraining Wall21 CATEGORY
count         87            87       87             87     87       87
unique         1            86        7              6     52        4
top     Prague17  Tomas Drabek      MAM              0   1.67        B
freq          87             2       40             74      6       28

In [20]:
dataset.describe() #by default describes only numerical data

              id     km4week       sp4week  MarathonTime
count  87.000000   87.000000     87.000000     87.000000
mean   44.000000   62.347126    139.840706      3.319080
std    25.258662   26.956019   1191.427864      0.376923
min     1.000000   17.900000      8.031414      2.370000
25%    22.500000   44.200000     11.498168      3.045000
50%    44.000000   58.800000     12.163424      3.320000
75%    65.500000   77.500000     12.854036      3.605000
max    87.000000  137.500000  11125.000000      3.980000

In [21]:
picked_rows = dataset.iloc[0:10,:]

In [22]:
picked_rows.to_csv('./Cutted.csv')

In [23]:
picked_rows

,id,Marathon,Name,Category,km4week,sp4week,CrossTraining,Wall21,MarathonTime,CATEGORY
0,1,Prague17,Blair MORGAN,MAM,132.8,14.434783,0,1.16,2.37,A
1,2,Prague17,Robert Heczko,MAM,68.6,13.674419,0,1.23,2.59,A
2,3,Prague17,Michon Jerome,MAM,82.7,13.520436,0,1.30,2.66,A
3,4,Prague17,Daniel Or lek,M45,137.5,12.258544,0,1.32,2.68,A
4,5,Prague17,Luk ? Mr zek,MAM,84.6,13.945055,0,1.36,2.74,A
5,6,Prague17,David Pecina,M40,42.2,13.612903,0,1.32,2.78,A
6,7,Prague17,Tomas Drabek,M40,89.0,12.594340,0,1.38,2.81,A
7,8,Prague17,Jan Rada,M45,106.0,12.694611,0,1.41,2.84,A
8,9,Prague17,Tomas Drabek,MAM,70.0,13.770492,ciclista 1h,1.38,2.83,A
9,10,Prague17,martin ?indel ?,M45,84.2,13.365079,0,1.35,2.86,A

In [24]:
picked_rows['Under2,5Hours'] = [1 if value < 2.5 else 0 for value in picked_rows['MarathonTime']]

/usr/lib/python3/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [25]:
picked_rows

,id,Marathon,Name,Category,km4week,sp4week,CrossTraining,Wall21,MarathonTime,CATEGORY,"Under2,5Hours"
0,1,Prague17,Blair MORGAN,MAM,132.8,14.434783,0,1.16,2.37,A,1
1,2,Prague17,Robert Heczko,MAM,68.6,13.674419,0,1.23,2.59,A,0
2,3,Prague17,Michon Jerome,MAM,82.7,13.520436,0,1.30,2.66,A,0
3,4,Prague17,Daniel Or lek,M45,137.5,12.258544,0,1.32,2.68,A,0
4,5,Prague17,Luk ? Mr zek,MAM,84.6,13.945055,0,1.36,2.74,A,0
5,6,Prague17,David Pecina,M40,42.2,13.612903,0,1.32,2.78,A,0
6,7,Prague17,Tomas Drabek,M40,89.0,12.594340,0,1.38,2.81,A,0
7,8,Prague17,Jan Rada,M45,106.0,12.694611,0,1.41,2.84,A,0
8,9,Prague17,Tomas Drabek,MAM,70.0,13.770492,ciclista 1h,1.38,2.83,A,0
9,10,Prague17,martin ?indel ?,M45,84.2,13.365079,0,1.35,2.86,A,0

In [26]:
picked_rows.groupby('Under2,5Hours').describe()

                 id                                          km4week  \
              count mean       std  min  25%  50%  75%   max   count
Under2,5Hours
0               9.0  6.0  2.738613  2.0  4.0  6.0  8.0  10.0     9.0
1               1.0  1.0       NaN  1.0  1.0  1.0  1.0   1.0     1.0

                           ...    sp4week            MarathonTime            \
                     mean  ...        75%        max        count      mean
Under2,5Hours              ...
0               84.977778  ...  13.674419  13.945055          9.0  2.754444
1              132.800000  ...  14.434783  14.434783          1.0  2.370000


                    std   min   25%   50%   75%   max
Under2,5Hours
0              0.093289  2.59  2.68  2.78  2.83  2.86
1                   NaN  2.37  2.37  2.37  2.37  2.37

[2 rows x 32 columns]

In [27]:
picked_rows.to_csv('./WithNewField.csv')

In [28]:
dataset.describe().to_csv('./Description.csv')